app/controllers/eventos_controller.rb

INSERT INTO "eventos" ("descricao", "tipo", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["descricao", "Desc A"], ["tipo", "Tipo A"], ["created_at", "2015-04-09 05:07:36.333869"], ["updated_at", "2015-04-09 05:07:36.333869"]]
---
  def create
    @evento = Evento.new(evento_params)

    respond_to do |format|
      if @evento.save

UPDATE "eventos" SET "descricao" = ?, "tipo" = ?, "updated_at" = ? WHERE "eventos"."id" = ?  [["descricao", "Desc A"], ["tipo", "Tipo A"], ["updated_at", "2015-04-09 05:13:46.319001"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @evento.update(evento_params)

DELETE FROM "eventos" WHERE "eventos"."id" = ?  [["id", 1]]
---
  def destroy
    @evento.destroy