app/controllers/ocorrencias_controller.rb

SELECT "ocorrencias".* FROM "ocorrencias"
---
  def index
    @ocorrencias = Ocorrencia.all

INSERT INTO "ocorrencias" ("latitude", "longitude", "datainicio", "datatermino", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["latitude", ""], ["longitude", ""], ["datainicio", "2015-04-11"], ["datatermino", "2015-04-11"], ["created_at", "2015-04-11 21:33:42.240335"], ["updated_at", "2015-04-11 21:33:42.240335"]]
---
  def create
    @ocorrencia = Ocorrencia.new(ocorrencia_params)

    respond_to do |format|
      if @ocorrencia.save

UPDATE "ocorrencias" SET "usuario_id" = ?, "evento_id" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "ocorrencias"."id" = ?  [["usuario_id", 1], ["evento_id", 1], ["latitude", "50"], ["longitude", "25"], ["updated_at", "2015-04-12 03:51:38.307527"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @ocorrencia.update(ocorrencia_params)

DELETE FROM "ocorrencias" WHERE "ocorrencias"."id" = ?  [["id", 1]]
---
  def destroy
    @ocorrencia.destroy

SELECT  "ocorrencias".* FROM "ocorrencias" WHERE "ocorrencias"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_ocorrencia
      @ocorrencia = Ocorrencia.find(params[:id])