app/controllers/usuarios_controller.rb

INSERT INTO "usuarios" ("nome", "email", "sexo", "dtnascimento", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "Luiz"], ["email", "Rua XXX"], ["sexo", "99999"], ["dtnascimento", "2015-04-09"], ["created_at", "2015-04-09 04:33:29.116825"], ["updated_at", "2015-04-09 04:33:29.116825"]]
---
  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save

UPDATE "usuarios" SET "nome" = ?, "email" = ?, "sexo" = ?, "dtnascimento" = ?, "updated_at" = ? WHERE "usuarios"."id" = ?  [["nome", "Luiz"], ["email", "eu@tu.com.br"], ["sexo", "Masculino"], ["dtnascimento", "2015-04-09"], ["updated_at", "2015-04-09 04:44:57.141227"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @usuario.update(usuario_params)

DELETE FROM "usuarios" WHERE "usuarios"."id" = ?  [["id", 1]]
---
  def destroy
    @usuario.destroy